{
  "personal": {
    "name": "Jose Gabriel",
    "secondName": "Verutti Narvaez",
    "title": "Full Stack Web Developer",
    "description": "Self-taught Full Stack Web Developer passionate about transforming innovative ideas into robust, scalable applications. Proactive and ownership-driven, I focus on high-quality code, creative problem-solving, informed technical decisions, and strong collaboration. A quick, adaptable learner with a solid foundation in ReactJS, Python, .NET, and cloud technologies, I aim to contribute significantly to impactful solutions in dynamic and innovative environments.",
    "image": "/profile.png",
    "email": "verutti.gabriel@gmail.com",
    "phone": "+57 3174515697",
    "education": "Ingeniería Biomédica - Universidad Autónoma de Occidente (2019-2024)",
    "links": {
      "linkedin": "https://linkedin.com/in/gabriel-verutti-narvaez-559576190",
      "github": "https://github.com/JoseVerutti",
      "portfolio": "https://joseverutti.netlify.app"
    }
  },
  "experience": [
    {
      "id": 1,
      "title": "Development Consultant",
      "company": "Intelecto SAS",
      "date": "Oct/2024 - Present",
      "description": "Development and maintenance of websites, portals, and intranets for corporate clients and government institutions, using technologies such as Angular, ReactJS, .NET, SharePoint, PowerApps, and Azure services. Collaboration in multidisciplinary teams for the delivery of customized solutions and deployment on cloud platforms like Azure. Projects include work for the Mining and public sector (Colombia) and Entertainment industry, demonstrating capability in large-scale projects using Microsoft ecosystem."
    },
    {
      "id": 2,
      "title": "Backend Professor",
      "company": "PONAO National Polytechnic of Arts and Crafts",
      "date": "Jan/2024 - Oct/2024",
      "description": "Instructed over 120 students in advanced backend development, focusing on Python with FastAPI. Designed and delivered modules on cloud services (AWS: DynamoDB, IAM, S3) and AWS AI services. Promoted coding best practices, Docker usage, and microservices architecture. This role demonstrates experience in education and technical mentorship."
    },
    {
      "id": 3,
      "title": "Backend Developer",
      "company": "Telemetry API Development",
      "date": "Jan/2023 - Dec/2023",
      "description": "Led the backend development of a RESTful API with FastAPI (Python) for real-time telemetry of an electric car, a competitor in 'EXPOingeniería 2023'. Collaborated on frontend development with ReactJS, ensuring seamless integration for data visualization. This project is an excellent example of MVP development with the required tech stack (React, Python)."
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "RumbaApp - Event Discovery Web Application",
      "description": "Conceptualization and development of an MVP web application for users in Colombia to find nearby parties and events. Leading the full development, from user interface to server logic and database. Focus on Agile MVP development, user-centered design, preparation for future scalability.",
      "image": "/Rumbaapp.jpg",
      "url": "https://rumbaapp.com/",
      "technologies": ["ReactJS", "FastAPI", "Python", "FireStore", "Google Cloud Services", "Docker"],
      "status": "In Progress",
      "type": "Collaboration Project"
    },
    {
      "id": 2,
      "title": "Agencia Nacional de Mineria (ANM)",
      "description": "I worked on the ANM project, where I developed an Intranet and a Portal for the organization. Some of the technologies we used included Drupal, SharePoint, Docker, and Azure Services.",
      "image": "/ANM.png",
      "url": "https://github.com/JoseVerutti",
      "technologies": ["Drupal", "SharePoint", "Docker", "Azure Services"],
      "status": "Done",
      "type": "Professional Project"
    },
    {
      "id": 3,
      "title": "Loteria del cauca",
      "description": "I worked on the Lotería del Cauca project, where I developed a web application for ticket purchases and also created the admin site. Some of the technologies we used included React, TypeScript, Angular, .NET Framework, SQL Server, and Azure Services.", 
      "image": "/loteria-del-cauca-logo.png",
      "url": "https://github.com/JoseVerutti",
      "technologies": ["React", "TypeScript", "Angular", ".NET Framework", "SQL Server", "Azure Services"],
      "status": "Done",
      "type": "Professional Project"
    },
    {
      "id": 4,
      "title": "LLM RAG Assistant",
      "description": "Development of a text review assistant leveraging OpenAI's GPT-3 model and Pinecone. It performs text analysis and research to provide context-based responses (RAG) derived from uploaded documents.",
      "image": "/ai.svg",
      "url": "https://github.com/JoseVerutti/RAGChatBot",
      "technologies": ["Python", "OpenAI API", "Pinecone", "Transformers library"],
      "type": "Personal/Research Project",
      "status": "Done"
    },
    {
      "id": 5,
      "title": "Posture Tracker",
      "description": "Development of a posture tracking application using Python, MediaPipe, and TensorFlow. The system detects and analyzes body posture by identifying key landmarks, and TensorFlow is used to train a model that assesses posture quality. The application provides users with feedback reports to help improve their posture and includes reminders to encourage regular activity breaks.",
      "image": "/posture.jpeg",
      "url": "https://github.com/JoseVerutti/PostureDetection",
      "technologies": ["Python", "MediaPipe", "TensorFlow"],
      "type": "Personal Project",
      "status": "Done"
    }
  ]
}